tutorials/multiRegion/film/VoFToFilm/0/VoF/U
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  14
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       volVectorField;
    location    "0/VoF";
    object      U;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [velocity];

internalField   uniform (0 0 0);

boundaryField
{
    film
    {
        type            mappedValue;
        value           $internalField;
    }

    bottom
    {
        type                flowRateOutletVelocity;
        volumetricFlowRate  2e-6;
        value               $internalField;
    }

    atmosphere
    {
        type        pressureInletOutletVelocity;
    }

    #includeEtc "caseDicts/setConstraintTypes"
}


// ************************************************************************* //
